0.orig/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volVectorField; 	
 location "0"; 	
 object U; 	
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0.3 0 0); 	

boundaryField
{

	in
	{ 
    	type 		    inletOutlet; 
    	inletValue 	    uniform (0.3 0 0);
    	value 		    uniform (0 0 0);
	}

	aboveIn
	{ 
    		type 		noSlip;
	}

    out
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

  
	aboveOut
	{
    		type 		noSlip;
	}

  	atmosphere
  	{
        	type            pressureInletOutletVelocity;
        	value           uniform (0 0 0);
  	}
  
  	"wall_.*"
  	{
        	type            noSlip;
  	}
}
// ************************************************************************* //
