0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	in
	{ 
            type fixedValue; 
    		value uniform 1;
	}

	aboveIn
	{ 
    		type 		zeroGradient; 

	}

	out
	{ 
            type fixedValue; 
    		value uniform 1;
	}

  
	aboveOut
	{
     		type 		zeroGradient; 
	}

   atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
  
  	"wall_.*"
  	{
        	type            zeroGradient;
  	}
}
// ************************************************************************* //
