0.orig/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 location "0"; 	
 object nut; 	
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 1.0; 	

boundaryField
{
  in
  {
        type	calculated;
	value	$internalField;
    }
  
  aboveIn
  {
        type	calculated;
	value	$internalField;
    }
  
  out
  {
        type	calculated;
	value	$internalField;
   }

  aboveOut
  {
        type	calculated;
	value	$internalField;
   }
  
  atmosphere
  {
        type	calculated;
	value	$internalField;
  }
   
  "wall_.*"
  {
        type            nutUWallFunction;
	value	$internalField;
  }
  
 }
