system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         10;  

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.05; 

purgeWrite      0;  

writeFormat     binary; 

writePrecision  12;

writeCompression uncompressed; 

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5; 
maxAlphaCo      0.5; 

maxDeltaT       0.005;

functions
{
    
}

// ************************************************************************* //
