system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4; //12; //32;

//singleProcessorFaceSets ((outlet -1) (inletWater -1) (inletAir -1) );

method           scotch; //hierarchical; //scotch;

hierarchicalCoeffs
{
    n               (2 6 1); //( 3 2 2 );
    delta           0.001;
    order           xyz;
}

distributed     no;

roots           ( );
